{
    "POINT_sw_1_0_s_1_0_cc_1": "A bubble chart in a linear layout visualizes a multivec file, showing the entire genome of hg38. The position and size of points are encoded using the data field named 'peak.' The color of points is sky blue. The title is 'Basic Marks: point' and the subtitle is 'Tutorial Examples'.",
    "EX_SPEC_PILEUP_sw_1_0_s_1_0_oc": "Coverage and pileup tracks in a linear layout visualizes sequence alignment using a BAM file, showing the chromosome 1 between 136,750 and 139,450. The height of bars in the coverage track represents the number of reads aligned in corresponding regions. The pileup track shows individual reads in different colors representing different types of structural variation, including 'normal read', 'deletion (+-)', 'inversion (++)', 'inversion (--)', 'duplication (-+)', 'more than two mates', 'mates not found within chromosome', and 'clipping.' The title is 'pileup Tack Using BAM Data'.",
    "multi_layer_circular_m_3_s_1_0_oc_cc_0": "A multi-row bar chart in a circular layout visualizes a multivec file, showing the chromosome 12 between 5,000,000 and 15,000,000. The six rows, named 'sample 1', 'sample 2', 'sample 3', 'sample 4', 'sample 5', 'sample 6', from outer to inner, are colored in six different colors, including blue, orange, green, red, purple, and brown.",
    "BRCA-US-f848b66f-bd9e-4fba-afd4-eb58848d1ef4": "A circular view and a linear view are arranged one above the other. Two views are linked by a blue interactive brush in the circular view. The circular view shows the entire genome, and the linear view shows the region corresponding to chromosome 1 of the circular view. The circular has five tracks, including an ideogram, a point annotation track, two range annotation tracks, and a line-connection track. The point annotation track visualizes JSON values. The first range annotation track is titled 'Gain,' showing genomic ranges in blue rectangles. The second range annotation track is titled 'Loss of Heterozygosity (LOH),' showing genomic ranges in red rectangles. The line-connection track shows lines connecting between two genomics positions. The lines are displayed in different colors based on categorical values of the data field named 'svclass.' The categories include 'Gain,' 'LOH,' 'Translocation,' 'Duplication,' 'Deletion,' and 'Inversion.' The linear view has nine tracks, having similar tracks as in the circular view, but with additional tracks. The additional tracks include a gene annotation track, a scatterplot, and two range annotation tracks. The scatterplot titled 'Point Mutation' visualizes a VCF file. The position of each point represents the distance to the previous mutation. Each point is colored in different colors based on the data field named 'SUBTYPE.' The first range annotation track visualizes a VCF file, showing two rows named 'Insertion' and 'Deletion.' The track displays rectangles with two different colors, yellow and green. The second range annotation track titled 'Copy Number Variants' visualizes a CSV file. The position of each bar represents a quantitative data field named 'total_cn.' The color of rectangles is 'lightgrey.'"
}